# GlobalParametersManager Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GlobalParametersManager Members
GlobalParametersManager Class Methods Properties See Also
---
The GlobalParametersManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreGlobalParametersAllowed | Tests whether global parameters are allowed in the given document. |
| Dispose | Releases all resources used by the GlobalParametersManager |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| FindByName | Finds whether a global parameter with the given name exists in the input document. |
| GetAllGlobalParameters | Returns all global parameters available in the given document. |
| GetGlobalParametersOrdered | Returns all global paramters in an ordered array. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsUniqueName | Tests whether a name is unique among existing global parameters of a given document. |
| IsValidGlobalParameter | Tests whether an ElementId is of a global parameter in the given document. |
| MoveParameterDownOrder | Moves given paramerer Down in the current order. |
| MoveParameterUpOrder | Moves given paramerer Up in the current order. |
| SortParameters | Sorts global parameters in the desired order. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
GlobalParametersManager Class
Autodesk.Revit.DB Namespace